{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful","Understand, thanks"],
      "responses": ["Happy to help!", "Any time!", "My pleasure","You are welcome"]
    },
    {
  "tag": "login/forgotpassword",
  "patterns": [
    "How can I reset my password? I can’t remember my password. ",
    "I can’t login with my account and password.",
    "Yes. Please reset my password."
  ],
  "responses": [
    "Currently we do not have this facility. Users will need to contact the admin.",
    "Do you want to find your password?",
    "Please contact the administrator for that.",
    "Have you check your account and password?"
  ]
},
{
  "tag": "login/admin",
  "patterns": [
    "How can I contact the admin? Can you give me the contact information?",
    "How can I contact the admin?"
  ],
  "responses": [
    "You can find the contact information in the webpage",
    "Please  click the ‘CONTACT’ button in the left panel"
  ]
},
    {
      "tag": "aitool/generalquestion",
      "patterns": [
        "What kinds of AI applications can be tested by this tool? Can I test NLP applications?",
        "So I can’t test NLP applications. Is it right?",
        "What functions are supported by the tool?",
        "What kinds of tests can be done with this tool?",
        "Can the tool generate test cases for one app without input and context definition by users?"
      ],
      "responses": [
        "Test cases can be generated for any type of application, but currently the application can have input type image only",
        "We will add the feature in future",
        "Input and context tree modeling,Test case modeling and Test case input modeling.",
        "All kinds of AI application.",
        "No"
      ]
    },

    {
      "tag": "aitool/testcaserelated",
      "patterns": [
        "What is test case modeling?",
        "What is the difference between test case input modeling and input tree modeling?",
        "Can functional and performance tests both be done?",
        "Is there template available for reference?"
      ],
      "responses": [
        "Generating Test Cases based on provided input and the context trees. With this feature, users can generate test cases for all the combination for the respective input and context trees.",
        "In Input tree modeling we are defining the factors which need to be considered while testing a certain product.  We use this tree while defining the test case group and to generate the test cases Test Case Input modeling refers to Data/Input Data required for the test case. In this module, we are providing the user ability to add input data to the test case either manually or with the help of a web search engine",
        "No. Only functional tests can be done.",
        "Not really",
        "We plan to do that later"
      ]
    },
    {
      "tag": "aitool/multipleuserrelated",
      "patterns": [
        "Can multiple users share a project and work together?",
        "What’s the plan for it?",
        "It’s necessary for team cooperation."
      ],
      "responses": [
        "No. This feature will need to be developed.",
        "It is not decided yet",
        "Yes, I agree"
      ]
    },
    {
      "tag": "aitool/testcasetrickyquestion",
      "patterns": [
        "What is the impact if the test tools are used by multiple users for different apps at the same time?",
        "Do you mean only one user one application can be supported at one time?",
        "What are the maximal test cases can be executed when the app performance is tested?",
        "Can multiple test cases be executed then?",
        "Can user use same login with currently with multiple browser?"
      ],
      "responses": [
        "Currently the app is in the development stage. So the performance capabilities are limited and not supported.",
        "Yes. We plan to support it in later version.",
        "Current the performance testing feature is not available",
        "No.",
        "No, one user can’t login with multiple browser."
      ]
    },
    {
      "tag": "dashboard/general",
      "patterns": [
        "How can I use spanning trees in the dashboard?",
        "Do you suggest not to use this?"
      ],
      "responses": [
        "We are in the process of reconfiguring the UI this feature will be removed",
        "You can try it, but your usage may be interrupted during the usage."
      ]
    },
    {
      "tag": "dashboard/testcases",
      "patterns": [
        "How can I use the test case group function best? ",
        "Got it. It’s the test cases organization method",
        "How can I control the test cases number of each test case branch?",
        "Can I input the limitation number?"
      ],
      "responses": [
        "Use Group Name , Version, Sub-version fields to create different groups for the same application",
        "You can limit the number of test cases by limiting the number of nodes in input and context tree."
      ]
    },
    {
      "tag": "dashboard/testcasesgroupsummary",
      "patterns": [
        "Where to check the test case execution status? ",
        "Is there any plan?",
        "Can multiple users modify the same application input and context classification input?",
        "Can I input the limitation number?",
        "Will you support multi-user access later?",
        "Can I set the test cases number for each test case branch?",
        "It’s needed to simplify the work",
        "Can I set specific execution time for the test cases?",
        "Do you have a plan for this function?",
        "I think it is very useful function if the test cases are huge and avoid workload traffic"
      ],
      "responses": [
        "currently this module is under development",
        "The release date is not determined yet",
        "No",
        "Let me check",
        "There is no plan yet",
        "We have no plan for it yet",
        "We will consider the schedule function"
      ]
    },
    {
      "tag": "getstarted/dataadminstration",
      "patterns": [
        "Can I upload my input classification?",
        "How can I upload my input classification?",
        "I tried to upload csv file, but it failed.",
        "Thanks for you help. Can I upload an excel file?",
        "Can I use input classification files as my content classification?",
        "What type of input classification file can I upload?"
      ],
      "responses": [
        "Yes. You can upload a JSON file.",
        "Go to Login -> Get Started -> DATA ADMINISTRATION. Then select JSON file,  select file type ( Input, Context or Output), click submit.",
        "Sorry, we use JSON file to generate testing cases.",
        "We only accept JSON file. You can go Go to Login → Get Started → DATA ADMINISTRATION 1. Select JSON File 2. Select File Type (Input,Context or Output) 3. Click submit.",
        "Sure",
        "JSON file"
      ]
    },
    {
      "tag": "getstarted/dataadminstationwithgraph",
      "patterns": [
        "How can I do the version control of the input and context classification input?? ",
        "What does copying tree for?",
        "Is there any naming convention?",
        "Is there any naming convention for the file?",
        "Where can I check my testing tree?"
      ],
      "responses": [
        "Use Group Name , Version, Sub-version fields to create different groups for the same application",
        "It’s used to copy the whole content of current version for producing a new version by modification",
        "Copy tree is to copy the version.",
        "Currently no.",
        "No",
        "Go to  Login → Get Started → DATA ADMINISTRATION WITH GRAPH Select tree/file from dropdown list. Tree will be displayed."
      ]
    },
    {
      "tag": "getstarted/dawithgraphnodes",
      "patterns": [
        "Hello, how can I edit my nodes for input classification?",
        "How many nodes can I add at most in one time?",
        "Can I add more nodes?",
        "I can't rename my node?",
        "Can I change the color of node?",
        "How many nodes can I enter for my input classification?",
        "Yes"

      ],
      "responses": [
        "Sure, you can edit or delete nodes.",
        "There is a ‘create 5 Nodes’ option to add five child nodes with default names. Then you can select the node to rename with appropriate values.",
        "Absolutely! There are two ways: First move your mouse over the node, right click then select ‘create child node’ option. A popup window will open. There is a plus(+) symbol on the popup window. With this you can add as many nodes required, then click create to add nodes to the tree. The second way is move your mouse over the node, right click then select ‘create 5 nodes’ option to add five child nodes with default names. Then select the node to rename with appropriate values.",
        "You can Go to Login → Get Started → DATA ADMINISTRATION WITH GRAPH Move the mouse over the node.Right click on it and select “Rename Node” option.A popup window will open.Change name and Click rename.",
        "Sorry, we don’t have this option.",
        "Are you asking about the tree?",
        "The tree should have only three levels. There is no limit on the number of nodes and child nodes. Higher the nodes more number of test cases will be generated."
      ]
    },
    {
      "tag": "getstarted/dawithgraphchildnodes",
      "patterns": [
        "What are the maximum child nodes for the parents nodes (child nodes for Invalid; child nodes for Valid)?",
        "Like can I have more than 10?",
        "Can I have 20 child nodes for the parents nodes?",
        "For real? Like as many as I want?",
        "If I have more than 50 child nodes for the parents nodes, would that be okay?",
        "How many nodes can I enter for my input classification?",
        "Yes"

      ],
      "responses": [
        "Do you mean number of nodes?",
        "There is no such limitation.",
        "Yes, of course.",
        "There should be no problem."
      ]
    },
    {
      "tag": "getstarted/dawithgraphinputclassification",
      "patterns": [
        "Is there any limitation for creating nodes for input classification?",
        "Thanks. Can I use scratching input classification file.",
        "Can I add more nodes?",
        "Can I change the color of node?",
        "How many nodes can I enter for my input classification?",
        "Yes",
        "Can I change the order of input classification?",
        "What can I do if I want to check my input classification cases?"

      ],
      "responses": [
        "The tree should have only three levels. There is no limit on the number of nodes and child nodes. Higher the nodes more no of test cases will be generated.So if possible create trees with key values.",
        "Sorry, we don't support this option. But you can upload your own JSON input classficiaction file.",
        "Absolutely! There are two ways: First move your mouse over the node, right click then select ‘create child node’ option. A popup window will open. There is a plus(+) symbol on the popup window. With this you can add as many nodes required, then click create to add nodes to the tree. The second way is move your mouse over the node, right click then select ‘create 5 nodes’ option to add five child nodes with default names. Then select the node to rename with appropriate values.",
        "Sorry, we don’t have this option.",
        "Are you asking about the tree?",
        "The tree should have only three levels. There is no limit on the number of nodes and child nodes. Higher the nodes more number of test cases will be generated.",
        "Nodes and Child Nodes are arranged/sorted based on name(A-Z) after each action(add,delete and rename)",
        "Can You find TEST CASE GROUP on your left?",
        "1.Select appropriate test case group 2.Scroll to right till you see the Action column 3.Hover over each action button to see the description 4.Click “View Test Cases” 5.User will be redirected to input test cases"
      ]
    },
    {
      "tag": "getstarted/dawithgraphtree",
      "patterns": [
        "Can I use my previous trees?",
        "Why things not working when I adding more level for my input classification tree?",
        "I tried to add forth level, but not working.",
        "What can I do if I want to delete my saved tree?"

      ],
      "responses": [
        "Sure, you can .",
        "The tree should have only three levels.",
        "Go to Login → Get Started → DATA ADMINISTRATION WITH GRAPH  Select tree/file from dropdown list. Click Delete."
      ]
    },
    {
      "tag": "getstarted/dawithgraphnodesdelete",
      "patterns": [
        "How can I delete nodes from input classification?",
        "Hello, I can’t find the delete button for input classification nodes. Can you help me?",
        "If I accidently delete the node, can I recover it?",
        "Can I recover deleted nodes?",
        "I can't find the way to delete nodes from classification?"

      ],
      "responses": [
        "Move mouse over the node. Right click on it and option to delete the node will be displayed.",
        "Sure. Move mouse over the node. Right click on it and option to delete the node will be displayed.",
        "Sorry, we don’t have that option. But you can create a new node.",
        "You need to go navigation: Login -> Get Started-> Data Administration with graph. Move mouse over the node.Right click on it and option to delete the node will be displayed."
      ]
    },
     {
      "tag": "getstarted/dawithgraphnodescreate",
      "patterns": [
        "I don't know how to create a child node from input classification, Could you help me?",
        "Do you have any more question?"

      ],
      "responses": [
        "Absolutely. Go to Login → Get Started → DATA ADMINISTRATION WITH GRAPH Move the mouse over the node.Right click on it and select “Create Child Node” option.A popup window will open. Add name for the node and click create.",
        "No, Thanks for your help."
      ]
    },
    {
      "tag": "getstarted/testcasegroup",
      "patterns": [
        "Hello, I can’t find my testing cases? Can you help me? ",
        "Yes. Thank You",
        "Do you know where I can find my input testing cases?"

      ],
      "responses": [
        "Yes, you can go to Login-> Get Started -> TEST CASE GROUP, then select appropriate test case group, scroll to right till you see the action column. Hover over each action button to see the description, click ‘View Test Cases’. Then you will be redirected to input test cases. Did I solve your problem?",
        "Yes for sure, could you please clarify 'previous information'?",
        "Previous information are the previous stages, like input and contect stages."
      ]
    },
    {
      "tag": "getstarted/testcasegroupoutput",
      "patterns": [
        "How can I fix the previous information when I am at the output stage?",
        "Can I edit the input and context without generating the output tree when I reach the output stage? Like can I edit the information without saving it?",
        "Could you please provide clarification?",
        "How do we improve the invalid output?",
        "I understand that, but can you provide a little bit more explanation?",
        "How is the output tree generated?"
      ],
      "responses": [
        "Users can create an output tree or output tree can be generated automatically based on the input and context tree. Once the “test case group” is created, users can edit input,context and output trees.",
        "No, you cannot.",
        "Once the “test case group” is created, users can edit input,context and output trees. Basically, you can generate the test case group first and then edit the information.",
        "expected output is generated from output tree and stored as tree (similar to the input and context tree).",
        "The output tree can be auto generated or the user can manually create the tree. User can manipulate this output tree to model the expected output",
        "The output tree can be auto generated."
      ]
    },
    {
      "tag": "getstarted/testcasegroupoutput2",
      "patterns": [
        "Can I do that manually?",
        "How to export the output? Can I download the report instead of going back and forth?",
        "I think you guy should really develop such function.",
        "How is each output stored? Are there options for us to select?",
        "What format is the application stored as?",
        "What type of version is the output?",
        "Yes, it is like what does it stored as?"
      ],
      "responses": [
        "Yes, You can.",
        "Currently we do not have this functionality. We are developing a report to export all test cases along with the input, expected output and application output.",
        "Thank you for  this suggestion!",
        "Expected output is generated from output tree and stored as tree (similar to the input and context tree).",
        "Application output is stored in the form of String. This output is generated by the application.",
        "Could you please explain what do you mean by version?",
        "Expected output is generated from output tree and stored as tree (similar to the input and context tree)."
      ]
    },
    {
      "tag": "getstarted/testcasegroupoutput3",
      "patterns": [
        "What if I accidentally return back to the previous stage, will output information be saved?",
        "Like going back to the context page/input page.",
        "What will happen if the 'generate test cases' action was triggered and I interrupted it?",
        "Yes",
        "What is the difference between expected output and application output?",
        "Like at the end.",
        "When is application output generated?",
        "When is the expected output generated?",
        "How is expected output tree used?"
      ],
      "responses": [
        "What do you mean by previous stage?",
        "Expected output is generated from the output tree once “generate test cases” action triggered. If this action is interrupted then test case generation will be terminated",
        "During the output stage right?",
        "Then the test case generation will be terminated.",
        "During which stage?",
        "Expected output is generated from the output tree. Application output is generated after the execution of test cases. Expected output tree will be used to compare actual application output to rate the quality",
        "Application output is generated after the execution of test cases.",
        "Expected output as the output for the final stage.",
        "Expected output tree will be used to compare actual application output to rate the quality."
      ]
    },
    {
      "tag": "getstarted/testcasegroupoutput3",
      "patterns": [
        "What if I accidentally deleted the whole test case?",
        "Yes",
        "Is there any way to restore the deleted test case?",
        "Yes, I am.",
        "Do I need to retrigger the generate test case action if I deleted input or context test case?",
        "Correct",
        "Where can I store the output information?",
        "Then?",
        "Where can I find the output information?",
        "Yes please."
      ],
      "responses": [
        "Are you looking for recovery?",
        "Our system doesn't provide recovery.",
        "Are you looking for restoration?",
        "Unfortunately no. If user deleted input/context test case then user will need to retrigger the generate test case action.",
        "For the deleted input or context test case?",
        "Yes, you do need to do that.",
        "You will need to create an output tree.",
        "In the child node user can put all the possible output strings or output tree can be generated automatically based on the input and context tree.",
        "In our system menu? Do you need navigations?",
        "Go to  Login → Get Started → Test Case Group"

      ]
    },
    {
      "tag": "getstarted/testcasegroupoutput4",
      "patterns": [
        "Why is there only one file version available?",
        "I mean in general.",
        "Can we have more than two parent nodes?",
        "Yes, for the output tree.",
        "Is there a limitation on the number of output we could have from the same dataset?",
        "Correct, with using the same input and context group.",
        "Could you provide some examples?"

      ],
      "responses": [
        "Do you mean the output file version? Or the input file version?",
        "Auto file versioning is not available but if you. Name the files accordingly and then user can store multiple versions of the file. Also, copy tree function is available",
        "For output generation?",
        "No. Currently we do not have this facility.",
        "During the output stage?",
        "Yes. You can generate different expected output tree for same input and context group.",
        "For a given image or video, which features are considered context?"

      ]
    },
    {
      "tag": "getstarted/testcasegroupdelete",
      "patterns": [
        "Where can I find the deleted test case? ",
        "Right.",
        "What type of action is for deleted test case?",
        "Like is it restorable?"

      ],
      "responses": [
        "Deleted from the Test Case Group?",
        "Delete action is hard delete. I.e., you cannot view the test case once deleted.",
        "Could you please clarify what do you by the type?",
        "No, delete action is hard delete."
      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttree",
      "patterns": [
        "How can I customize my own context tree?",
        "Great! Do you mean each node represents a context feature?",
        "Is there any limit to the number of nodes that I can enter?",
        "Here, you mean at each level. Is there an upper limit on the total levels of nodes?",
        "Hi, I cannot add a child node to the 4th level of the context tree. How can I fix this?",
        "Ok, got it! I will modify it."


      ],
      "responses": [
        "You can customize your context features by simply changing the labels of nodes, adding or deleting nodes in the context tree.",
        "Yep! Each node in the context tree stands for a context feature you designed. Besides, just let you know, you can enter subnodes as subfeatures as well.",
        "There is no limit to the number of nodes you can create at each level. You can add nodes as needed.",
        "Yes, you are right! So far, our context tree only supports 3 levels. When designing the context tree, be careful to the level restriction.",
        "Oh, sorry to inform you that our context tree only supports up to 3 levels of design. I am afraid you have to get rid of the 4th level or simplify your design to 3 levels.",
        "You can modify it offline and then upload the modified file, or modify online in the workspace and save the updated version."
      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttree2",
      "patterns": [
        "What’s the recommended number of input features for a context tree? Is there any limit?",
        "Got it! Will too many nodes affect efficiency?",
        "How can I organize the context features? Can you provide a template?",
        "How many subfeatures can I add to a context feature?",
        "How can I change the order between features?"

      ],
      "responses": [
        "There is no limit to the number of nodes and child nodes, but tree should have only three levels.",
        "Great question! The greater the number of nodes, the more test cases will be generated and the longer it will take. So if possible create a tree with necessary key values.",
        "You can organize your context features into a tree structure level by level. A parent node presents a context feature, and a child node presents a subfeature of that context feature.",
        "There is no limit to the number of subfeatures you can add. But be careful, our context tree design only supports up to 3 levels.",
        "Go to  Login → Get Started → DATA ADMINISTRATION WITH GRAPH"
      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode",
      "patterns": [
        "I tried to rearrange the order of child nodes in my tree but failed. Can you help me figure it out?",
        "Got it! Will too many nodes affect efficiency?",
        "How can I organize the context features? Can you provide a template?",
        "How many subfeatures can I add to a context feature?",
        "How can I change the order between features?",
        "What actions can I do to a node in the context tree?",
        "How can I delete or add a node?"

      ],
      "responses": [
        "I am sorry. Users are not allowed to do that directly. Nodes and child Nodes are sorted based on name (A-Z) after each action (add, delete and rename).",
        "Great question! The greater the number of nodes, the more test cases will be generated and the longer it will take. So if possible create a tree with necessary key values.",
        "You can organize your context features into a tree structure level by level. A parent node presents a context feature, and a child node presents a subfeature of that context feature.",
        "There is no limit to the number of subfeatures you can add. But be careful, our context tree design only supports up to 3 levels.",
        "Go to  Login → Get Started → DATA ADMINISTRATION WITH GRAPH",
        "You can add, delete or rename a node in the context tree.",
        "Navigation : Login → Get Started → DATA ADMINISTRATION WITH GRAPH. Hover mouse on the target node, and right click. You'll see the corresponding options."
              ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode2",
      "patterns": [
        "Does the order of nodes at each level matter?",
        "If I add more than 10 nodes at a level, would it be too much?",
        "I mistakenly deleted the context tree I just created. Is there any way to restore it?",
        "I didn't. Do I need to rebuild it from scratch?",
        "The webpage was frozen when I was creating the context tree. If I refresh this page, will I lose my records?",
        "I saved! Where can I find the saved version.",
        "How can I correct the typo in my node label?",
        "Move the mouse over the node. Right click on it and select “Rename Node” option. A popup window will open.Change name and Click rename."

      ],
      "responses": [
        "Navigation : Login → Get Started → DATA ADMINISTRATION WITH GRAPH. Hover mouse on the target node, and right click. You'll see the corresponding options.",
        "The order of nodes at each level will be automatically sorted based on name (A-Z) after each action. The order doesn't affect test cases generation.",
        "Actually, there is no restrictions. However, more nodes will take more time to generate test cases and modeling inputs.",
        "Did you save it? You can only restore info from the saved tree.",
        "I am sorry, the answer is YES.",
        "Did you save it? You can only restore records from the saved tree. If you didn't, you'll lose all the info.",
        "Go to  Login → Get Started → DATA ADMINISTRATION WITH GRAPH. Select tree/file from dropdown list.",
        "Move the mouse over the node. Right click on it and select “Rename Node” option. A popup window will open.Change name and Click rename."
      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode2",
      "patterns": [
        "How can I zoom in the tree I built, because all the nodes are squeezed together?",
        "Can I specify the file save path in advance instead of selecting it every time?",
        "If I switch to other app and come back, the same directory still open?",
        "I’d like to turn a sub-feature into a higher level feature, and how can I make this modification?",
        "Can I perform the same operation to downgrade a feature to a lower level?",
        "Can I add multiple nodes to my context tree at once?",
        "Could you explain in more detail?"

      ],
      "responses": [
        "There are three ways. 1. Click near the tree Area (If tree is not manipulated). Use mouse scroll to zoom-in and zoom-out the tree.",
        "No, we don't have that option. We utilize systems file explorer. But once user opens the directory and selects a file, the same directory will open during the user session.",
        "Not exactly. The same directory stays open only if you only use this app.",
        "Go to  Login → Get Started → DATA ADMINISTRATION WITH GRAPH. Drag and rearrange nodes feature is available. You can modify the tree this way.",
        "Exactly. The operation is the same.",
        "Of course. Mouse hover on a node and right click. Choose the \"Create Child Node\" option. You can customize the nodes to be added in the popup window.",
        "Sure.There is a plus(+) symbol on the popup window. With this you can add as many nodes required, then click create to add nodes to the tree."


      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode3",
      "patterns": [
        "Can I merge the nodes at level 2 and level 3 in my context tree?",
        "How can I achieve it?",
        "Hi, where can I find my saved context tree file?",
        "Can I continue to modify on it?",
        "Can I build two separate context trees in the file? ",
        "What I mean is to create two separate trees with separate roots.",
        "Can I create my context tree offline and then upload the file?",
        "What format does the app support?"

      ],
      "responses": [
        "Do you mean reconstruct your context tree? Of course, you can do it.",
        "Go to  Login → Get Started → DATA ADMINISTRATION WITH GRAPH. Drag and rearrange nodes feature is available .",
        "Select tree/file from dropdown list. Tree will be displayed.",
        "Sure. But don't forget to save your changes.",
        "Could you elaborate a bit more on 'separate context trees' you mentioned ?",
        "At this stage, our application does not support multiple context trees in a file. A file only contains a tree.",
        "Sure. You can choose to upload files or create online.",
        "JSON. You should build your context tree as a json file."

      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode4",
      "patterns": [
        "Can I download the context tree I built on the app?",
        "Great! If I want to modify the tree, I need to upload the file again?",
        "What actions can I do to a tree node?",
        "Where can I find the option list you mentioned?",
        "Can I merge the child nodes of a node to another node at the same level?",
        "Great! What's the upper bound of the number of child nodes?"


      ],
      "responses": [
        "Yes. After you save it, we can download the corresponding json file generated by the app.",
        "Yes, that's one way. Another way is to modify the json file directly.",
        "Actions, such as add, delete, rename and etc. You can find different actions in the option list.",
        "Mouse hovers on a node and right click, then the option list will appear.",
        "Yes, you can. Just drag and rearrange the nodes in your tree.",
        "There is no limit. You can add child nodes as needed."


      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode5",
      "patterns": [
        "I have been waiting for the test cases to be generated for a long time. It takes like forever...",
        "Over 100 nodes.",
        "It took me a long time to generate all the test cases. Is there a problem with too many nodes in my context tree?",
        "How can I delete a node?",
        "While building the context tree, my web page was frozen. what should I do?",
        "You mean if I refresh I will lose what I have built so far!?"
      ],
      "responses": [
        "May I ask how many nodes in your context tree?",
        "The more nodes, the more test cases will be generated. It will take a looooong time. So if possible delete some redundant nodes and just retain the key ones.",
        "I think you created too many nodes in you context tree. You can delete some redundant nodes and just keep the important ones.",
        "Mouse hovers on a node and right click. Then you will see the delete option.",
        "Probably you could try to refresh the page and redraw your tree.",
        "Sorry, if the network connection is lost, we will not be able to recover what you created. Try to save the file often."

      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode5",
      "patterns": [
        "There is little room for me to add nodes to the third level of the context tree.",
        "Yes, I would like to zoom out a bit. How can I do that?",
        "How many contents can I add to my context?",
        "Yes, that's exactly what I mean. I want to know the limit to the number of nodes I can add to the tree.",
        "Can I merge two context trees into a single one online?",
        "Is there any other way to merge two context trees? I don't want to build the merged tree from scratch."

      ],
      "responses": [
        "Do you want to zoom in or zoom out the tree?",
        "Mouse scroll to zoom-in and zoom-out the tree, or click and hold to move tree around.",
        "Do you mean how many nodes you can add to your context tree? Am I right?",
        "There is no limit to the number of nodes in the context tree, but you can only have one root.",
        "I am afraid you can't do it online. Because in the online editing, we only allow to add one and only one root node.",
        "You can merge the two tree files offline. And then upload the merged JSON file."
      ]
    },
    {
      "tag": "getstarted/dawithgraphcontexttreenode6",
      "patterns": [
        "What's the maximum depth of the context tree?",
        "Can we specify the weights on the edge of the tree?",
        "Can we customize property to each node?",
        "I mean the node detail, such as creation time, last modification time, number of children and etc.",
        "How many parents can each child node have?",
        "Got it. And how many child nodes can each node have?",
        "Can we have customized shape of nodes when drawing the tree?",
        "Maybe you should add this functionality in the futher. I think it's important for users to classify nodes in different groups."

      ],
      "responses": [
        "You can merge the two tree files offline. And then upload the merged JSON file.",
        "The context tree should have up to 3 levels.",
        "Sorry, now we don't have this function.",
        "What do you mean by property?",
        "Sorry, now we only support adding category names to each node.",
        "In our application, each child node can have and only have one parent node.",
        "There is no limit to the number of child nodes.",
        "Sorry, we don't have such function.",
        "Thanks for your suggestion. We'll think about it."
      ]
    }

  ]
}
